import React, { Component } from 'react';
import { Link } from 'react-router-dom';
import DeleteModal from './deletemodal';


export default class NoteView extends Component {
    render() {
        return (
          <div className='mainNoteWrapper'>
                <div className='EditDel_Wrap'>
              <Link className="btn btn-primary edit" to="/editnote">Edit</Link>
                    <button type="button " id="dan" className="btn btn-danger edit" data-toggle="modal" data-target="#exampleModal">
                        Delete
                    </button>
                    
                </div>
                  <div >
                      <h1 className="view text-white">Note Name</h1>
                        <p className="text-white">إذ وشعار إحتار الإنزال كلّ. عرض ان تسمّى الطريق, ثم دار وقبل كردة مهمّات, فصل مع وزارة وأكثرها الإحتفاظ. على وعلى تحرّك بل, قد إعادة كنقطة الثقيل ذات, وبعد يعبأ مكثّفة الا إذ. عل مدن ليركز إختار العصبة, قد كما وبدون إستيلاء.

                          وعُرفت الإثنان أي قبل, ما بحث الدمج وشعار. أم قام ويعزى مسؤولية الإتحاد, بالولايات الاندونيسية بها عل. الله دأبوا اتّجة تم شيء. بـ بين وكسبت وقوعها، بالتوقيع, في عرض فقامت الوراء الإمتعاض. ذلك ٣٠ الجو الأوضاع, تم ذات أسيا تشكيل الشتاء،. أخذ لغزو المارق ثم.

                          تم شموليةً الدنمارك حدى, كل ليبين أسابيع ذات. إذ بلا قِبل اعتداء. بقسوة اعلان يرتبط ثم أضف, حاول ضمنها في الا. وصل شواطيء أوروبا وايرلندا هو. ٣٠ بلاده بمعارضة عسكرياً جعل, إيو عن الصعداء وبلجيكا،.

                          نتيجة وبريطانيا الدولارات قد فعل, هذا قد وبعد فشكّل ومحاولة. هو قررت نتيجة إيو, ان غير مليارات باستحداث, وصل احداث فقامت بل. لغزو اكتوبر عرض ٣٠, ثم نفس التي الإمداد الواقعة. أسر بل إجلاء أعلنت, وصغار الأرضية ومطالبة بحق إذ. وسوء يتبقّ لإنعدام إذ تحت, ان السيء والفلبين التقليدية مما. عن الإمداد تزامناً ايطاليا، لها, وسوء حادثة حاملات ما بلا.

                          فمرّ الأمريكية أي يكن, ولم إذ فبعد وهولندا،. إذ تصرّف العصبة للسيطرة شيء. فعل يتمكن الضروري الأرواح إذ. عجّل الإطلاق عل بحث, أضف الأرواح والنفيس واقتصار ثم. دون تم مئات الأثنان الأوروبيّون. من عقبت الحرة وقد, واستمرت بالسيطرة إذ كلّ, الضروري الاندونيسية تم إيو.

                          بعد و بزمام تكاليف الانجليزية. كل حين الشرقي العالم, موالية المشترك عل أخر. مكن عل نقطة يعبأ والنرويج, ثم بال حاول وبعض, بـ أحدث محاولات مليارات انه. بين مرجع أملاً لم. انه هو أمّا المارق وانتهاءً, الثقيلة والإتحاد ما قام.

                          فشكّل الأرواح المتساقطة، إذ عرض, مع دار الشمال تحرّكت, إذ هامش أسيا أضف. لم يكن فسقط أوزار النزاع. العدّ بريطانيا هذه تم. إذ وبعد أراض الكونجرس قام.<br/>

                          بـ دنو قادة مليون, منتصف المدن تكتيكاً حول أن. وترك عليها رجوعهم هذا لم, مكن بهيئة وقوعها، المتاخمة من, بـ شعار فكانت مكثّفة كان. الا واُسدل والنفيس ما, حالية أثره، قد غير, تسمّى بولندا، اليابان، و الى. قامت ليبين لكل لم. مكّن احداث الحيلولة تم بها, في ساعة المحيط بال.
                                                  
                                                  الفترة عالمية قد قام, بل جديداً الثالث، الأسيوي كلا. إذ وبعد قررت أمدها مما, ما بقعة ضمنها استراليا، أضف, الى تُصب وانتهاءً اقتصادية ان. لكل الجنرال الإحتفاظ أي, ما لغزو إستيلاء بال. إذ الآخر الستار اليابانية أخذ, هو أخذ البشريةً الأوروبيّون. أي كلّ هُزم ليركز باستحداث, حدى هو وبحلول المواد, أخذ أمّا القوى قد. انه بل ونتج عُقر. تسمّى منتصف وبحلول عدد ٣٠, عرض عن أساسي أعمال بولندا،.
                                                  
                          خطّة للحكومة فعل إذ, غير تحرير أسابيع بالجانب إذ, لان ثم الإتحاد التغييرات. عل العظمى العسكري فصل, إيو عقبت إعمار عل, ان الغالي الأثنان فقد. اكتوبر وأكثرها تم ضرب. من فرنسية ألمانيا الا, نفس الطريق حاملات بمحاولة و, مع بقعة بمباركة الصفحات بال. ضرب القوى استراليا، هو.</p>
                  </div>                    
                    
                <Link className="button save" to="/">Save</Link>
                <DeleteModal />
            </div>
        );
    }
}